app/views/blog_posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."blog_post_id" = ?  [["blog_post_id", 3]]
---
	</div>
	<% @blog_post.comments.each do |comment| %>